7767517
100 112
Input            data                     0 1 data
Convolution      244                      1 1 data 244 0=16 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=432
ReLU             246                      1 1 244 246
Split            splitncnn_0              1 2 246 246_splitncnn_0 246_splitncnn_1
ConvolutionDepthWise 247                      1 1 246_splitncnn_1 247 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=144 7=16
ReLU             249                      1 1 247 249
Convolution      250                      1 1 249 250 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
BinaryOp         252                      2 1 246_splitncnn_0 250 252 0=0
Convolution      253                      1 1 252 253 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
ReLU             255                      1 1 253 255
ConvolutionDepthWise 256                      1 1 255 256 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             258                      1 1 256 258
Convolution      259                      1 1 258 259 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
Split            splitncnn_1              1 2 259 259_splitncnn_0 259_splitncnn_1
Convolution      261                      1 1 259_splitncnn_1 261 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
ReLU             263                      1 1 261 263
ConvolutionDepthWise 264                      1 1 263 264 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             266                      1 1 264 266
Convolution      267                      1 1 266 267 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
BinaryOp         269                      2 1 259_splitncnn_0 267 269 0=0
Split            splitncnn_2              1 2 269 269_splitncnn_0 269_splitncnn_1
Convolution      270                      1 1 269_splitncnn_1 270 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
ReLU             272                      1 1 270 272
ConvolutionDepthWise 273                      1 1 272 273 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             275                      1 1 273 275
Convolution      276                      1 1 275 276 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
BinaryOp         278                      2 1 269_splitncnn_0 276 278 0=0
Split            splitncnn_3              1 2 278 278_splitncnn_0 278_splitncnn_1
Convolution      279                      1 1 278_splitncnn_1 279 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
ReLU             281                      1 1 279 281
ConvolutionDepthWise 282                      1 1 281 282 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=288 7=32
ReLU             284                      1 1 282 284
Convolution      285                      1 1 284 285 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
Split            splitncnn_4              1 2 285 285_splitncnn_0 285_splitncnn_1
Convolution      287                      1 1 285_splitncnn_1 287 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
ReLU             289                      1 1 287 289
ConvolutionDepthWise 290                      1 1 289 290 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             292                      1 1 290 292
Convolution      293                      1 1 292 293 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
BinaryOp         295                      2 1 285_splitncnn_0 293 295 0=0
Split            splitncnn_5              1 2 295 295_splitncnn_0 295_splitncnn_1
Convolution      296                      1 1 295_splitncnn_1 296 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
ReLU             298                      1 1 296 298
ConvolutionDepthWise 299                      1 1 298 299 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             301                      1 1 299 301
Convolution      302                      1 1 301 302 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
BinaryOp         304                      2 1 295_splitncnn_0 302 304 0=0
Split            splitncnn_6              1 2 304 304_splitncnn_0 304_splitncnn_1
Convolution      305                      1 1 304_splitncnn_1 305 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
ReLU             307                      1 1 305 307
ConvolutionDepthWise 308                      1 1 307 308 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             310                      1 1 308 310
Convolution      311                      1 1 310 311 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
BinaryOp         313                      2 1 304_splitncnn_0 311 313 0=0
Split            splitncnn_7              1 2 313 313_splitncnn_0 313_splitncnn_1
Convolution      314                      1 1 313_splitncnn_1 314 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
ReLU             316                      1 1 314 316
ConvolutionDepthWise 317                      1 1 316 317 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             319                      1 1 317 319
Convolution      320                      1 1 319 320 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
Split            splitncnn_8              1 2 320 320_splitncnn_0 320_splitncnn_1
Convolution      322                      1 1 320_splitncnn_1 322 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             324                      1 1 322 324
ConvolutionDepthWise 325                      1 1 324 325 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304 7=256
ReLU             327                      1 1 325 327
Convolution      328                      1 1 327 328 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
BinaryOp         330                      2 1 320_splitncnn_0 328 330 0=0
Split            splitncnn_9              1 2 330 330_splitncnn_0 330_splitncnn_1
Convolution      331                      1 1 330_splitncnn_1 331 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             333                      1 1 331 333
ConvolutionDepthWise 334                      1 1 333 334 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304 7=256
ReLU             336                      1 1 334 336
Convolution      337                      1 1 336 337 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
BinaryOp         339                      2 1 330_splitncnn_0 337 339 0=0
Split            splitncnn_10             1 2 339 339_splitncnn_0 339_splitncnn_1
Convolution      340                      1 1 339_splitncnn_1 340 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             342                      1 1 340 342
ConvolutionDepthWise 343                      1 1 342 343 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304 7=256
ReLU             345                      1 1 343 345
Convolution      346                      1 1 345 346 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
BinaryOp         348                      2 1 339_splitncnn_0 346 348 0=0
Convolution      349                      1 1 348 349 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
ReLU             351                      1 1 349 351
ConvolutionDepthWise 352                      1 1 351 352 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             354                      1 1 352 354
Convolution      355                      1 1 354 355 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
Split            splitncnn_11             1 2 355 355_splitncnn_0 355_splitncnn_1
Convolution      357                      1 1 355_splitncnn_1 357 0=128 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=73728
ReLU             359                      1 1 357 359
Pooling          361                      1 1 359 361 0=1 1=5 11=3 2=5 12=3 3=0 13=0 14=0 15=0 5=1 6=0
Reshape          369                      1 1 361 369 0=-1
Pooling          371                      1 1 278_splitncnn_0 371 0=1 1=40 11=20 2=40 12=20 3=0 13=0 14=0 15=0 5=1 6=0
Reshape          379                      1 1 371 379 0=-1
Pooling          381                      1 1 313_splitncnn_0 381 0=1 1=20 11=10 2=20 12=10 3=0 13=0 14=0 15=0 5=1 6=0
Reshape          389                      1 1 381 389 0=-1
Pooling          391                      1 1 355_splitncnn_0 391 0=1 1=10 11=5 2=10 12=5 3=0 13=0 14=0 15=0 5=1 6=0
Reshape          399                      1 1 391 399 0=-1
Concat           400                      4 1 379 389 399 369 400 0=0
InnerProduct     401                      1 1 400 401 0=64 1=1 2=15360
PReLU            prelu1                   1 1 401 prelu1 0=64
